package pro.sky.animal_shelter.content;

public class TelegramBotContent {

    public static final String WELCOME_MESSAGE = "Добро пожаловать в нашего бота! Введите /help, чтобы узнать, что я могу.";

    public static final String WELCOME_PHOTO = "https://keephere.ru/get/xMzDQofmjH8/o/photo.jpg";

    public static final String HISTORY = "Хаски — сила и скорость, сравниться с которой может только ветер, воплощение духа свободы, воплощение мечты." +
            "Красота ледяных глаз сыграла с ними злую шутку. Глянцевые таблоиды, сверкающие киноленты, ламповые блоги сделали этих собак пленниками минутных желаний человека." +
            "Зачастую принося домой синеглазого щенка люди не представляют и половины трудностей, с которыми им придется столкнуться, чтобы из маленького комочка выросла достойная, здоровая, социализированая собака. " +
            "В нашем приюте содержится сегодня более 60 собак породы хаски. Каждая из них имеет свою историю, каждая пережила предательство человека." +
            "Мы стараемся реагировать на все обращения о помощи, но, к сожалению, наши ресурсы не безграничны." +
            "Мы верим, что у каждой собаки есть свой человек, и главная задача нашего Фонда — помочь им встретиться!" +
            " На данный момент обрели новый дом более 200 собак. В настоящее время на всей территории Большого Урала не существует приюта для гладкошерстных собак серьезных пород," +
            " поэтому помощь получают далеко не все, кто в ней нуждается.";

    public static final String ADDRES = "Свердловская область, Каменский городской округ, село Черемхово, координаты на карте 56.521009, 61.793812.";

    public static final String SCHEMA_SHELTER = "https://keephere.ru/get/_MzDKXreNJ9/o/photo.jpg";

    public static final String OPENING_HOURS = "Что такое счастье?\n" +
            "\n" +
            "Люди веками ищут ответ на этот вопрос.\n" +
            "Для собак мир устроен гораздо проще.\n" +
            "\n" +
            "Счастье - это поводок в ваших руках….\n" +
            "Счастье - это возможность бежать рядом с вами...\n" +
            "Счастье - это ваши эмоции и объятия…\n" +
            "Счастье - это несколько часов вместе.\n" +
            "\n" +
            "Человека нельзя осчастливить, но вот подарить радость бездомной собаке - может каждый из вас.\n" +
            "\n" +
            "Каждые выходные с 10 до 17 мы приглашаем всех в гости!\n" +
            "В одиночку или в компании, с коллегами или с семьей!\n" +
            "Приезжайте!\n" +
            "У нас счастья хватит на всех!\n" +
            "Предварительная запись обязательна!";

    public static final String DONATE = "Помощь собакам фенотипа сибирский хаски, аляскинский маламут, самоед.\n" +
            "\n" +
            "Друзья, мы - маленькая команда единомышленников, и все, что мы делаем, мы делаем, только благодаря Вашей поддержке!\n" +
            "\n" +
            "Истории всех наших подопечных можно прочитать на нашем сайте\n" +
            "\n" +
            "БЛАГОТВОРИТЕЛЬНЫЙ ФОНД \"СЧАСТЬЕ В ДОМ\"\n" +
            "Расчётный счёт: 40701810116540000449\n" +
            "ИНН: 6679129573\n" +
            "КПП: 667901001\n" +
            "ОГРН: 1196658078814\n" +
            "Банк: УРАЛЬСКИЙ БАНК ПАО СБЕРБАНК\n" +
            "БИК: 046577674\n" +
            "Кор. счёт: 30101810500000000674";

    public static final String SAFETY_MEASURES = "Наш приют находится в поле близ села Черемхово, одевайтесь соответственно и по погоде." +
            "В теплое время года не забывайте о акарицидно-реппелентных средствах. Мы со своей стороны обещаем вам тёплый приём, ароматный чай, " +
            "место для отдыха и переодевания и подробную экскурсию с рассказом о наших подопечных.";

    public static final String PRE_ADOPTION_RULES = "Правила знакомства с животным до того, как забрать его из приюта:\n" +
            "1. Посетите приют несколько раз, чтобы познакомиться с животным.\n" +
            "2. Принесите с собой любимые игрушки или лакомства животного.\n" +
            "3. Проводите время с животным на прогулке или в игровой зоне приюта.\n" +
            "4. Обсудите с сотрудниками приюта особенности характера и поведения животного.";

    public static final String ADOPTION_DOCUMENTS_LIST = "Список документов для усыновления:\n" +
            "1. Паспорт гражданина РФ.\n" +
            "2. Договор об ответственном содержании животного (предоставляется приютом).\n" +
            "3. Документ, подтверждающий право собственности на жилую площадь или договор аренды жилья.";

    public static final String TRANSPORT_RECOMMENDATIONS = "Рекомендации по транспортировке:\n" +
            "1. Используйте специальные переноски для кошек и мелких собак.\n" +
            "2. Для крупных собак используйте автомобильные ремни безопасности или клетки.\n" +
            "3. Убедитесь, что животное комфортно и безопасно расположено в транспортном средстве.\n" +
            "4. Возьмите с собой воду и лакомства для животного.";

    public static final String PUPPY_SETUP_RECOMMENDATIONS = "Обустройство дома для щенка:\n" +
            "1. Подготовьте уютное место для сна щенка, используя мягкую подстилку или кроватку.\n" +
            "2. Обеспечьте щенку доступ к свежей воде и питательной пище.\n" +
            "3. Приобретите игрушки для развития и развлечения щенка.\n" +
            "4. Обучайте щенка правилам поведения в доме и на улице.";

    public static final String ADULT_ANIMAL_SETUP_RECOMMENDATIONS = "Обустройство дома для взрослого животного:\n" +
            "1. Обустройте уютное место для сна и отдыха животного.\n" +
            "2. Обеспечьте животному доступ к воде и полноценному питанию.\n" +
            "3. Приобретите необходимые аксессуары: миски, игрушки, когтеточку и т.д.\n" +
            "4. Уделяйте время для общения и игр с животным, чтобы помочь ему адаптироваться.";

    public static final String SPECIAL_NEEDS_ANIMAL_SETUP_RECOMMENDATIONS = "Обустройство дома для животного с ограниченными возможностями:\n" +
            "1. Создайте безопасную и комфортную среду для животного.\n" +
            "2. Подготовьте специальные приспособления для облегчения передвижения (пандусы, подушки и т.д.).\n" +
            "3. Обеспечьте доступ к медицинской помощи и регулярным осмотрам у ветеринара.\n" +
            "4. Уделяйте больше внимания и заботы, чтобы животное чувствовало себя защищённым и любимым.";

    public static final String CYNOLOGIST_TIPS = "Советы кинолога по первичному общению с собакой:\n" +
            "1. Будьте терпеливы и не спешите. Дайте собаке время привыкнуть к вам.\n" +
            "2. Используйте спокойный и уверенный тон голоса при общении с собакой.\n" +
            "3. Вознаграждайте собаку за хорошее поведение лакомствами и похвалой.\n" +
            "4. Избегайте резких движений и громких звуков, чтобы не пугать собаку.";

    public static final String CYNOLOGIST_RECOMMENDATIONS = "Рекомендации по проверенным кинологам:\n" +
            "1. Иванов Иван Иванович - опыт работы 10 лет, специализация на обучении послушанию и защите.\n" +
            "2. Петрова Ольга Сергеевна - опыт работы 8 лет, специализация на коррекции поведения и социализации.\n" +
            "3. Смирнов Алексей Владимирович - опыт работы 12 лет, специализация на спортивной дрессировке и подготовке к соревнованиям.";

    public static final String ADOPTION_REJECTION_REASONS = "Причины отказа в усыновлении:\n" +
            "1. Недостаток условий для содержания животного.\n" +
            "2. Отсутствие стабильного дохода и возможности обеспечить животному надлежащий уход.\n" +
            "3. Негативный опыт предыдущего содержания животных (жестокое обращение, плохие условия).\n" +
            "4. Несоответствие требований по возрасту и состоянию здоровья животного к условиям усыновления.";

    public static final String OTCHET_O_PITOMCE = "Отчёт должен содержать следующее:\n" +
            "* Фото питомца (Формат: jpeg, jpg или png.\n" +
            "* Рацион питомца (Завтрак, обед и ужин)\n" +
            "* Общее самочувствие и привыкание к новому месту. То есть то, как он себя ведёт, какое у него настроение.\n" +
            "* Изменения в поведении: отказ от старых привычек, приобретение новых.\n \n" +
            "Если вы готовы прислать отчёт, нажмите на кнопку (Начать процесс) и мы начнём процедуру составления отчёта.";

    public static final String HOW_TO_DEAL_WITH_CAT = "Правила обращения с кошкой следующие:\n" +
            "* Будьте нежными и уважительными: Никогда не кричите на кошку и не бейте ее. Уважайте ее личное пространство и дайте ей возможность отойти, если она не хочет общения.\n" +
            "* Регулярный уход: Обеспечивайте кошке регулярный уход, включая кормление качественной едой, чистку лотка и расчесывание шерсти, если это необходимо.\n" +
            "* Обеспечьте безопасность: Следите за тем, чтобы кошка была в безопасности, особенно если она выходит на улицу. Избегайте контактов с потенциально опасными предметами или веществами.\n" +
            "* Игры и внимание: Проводите время с кошкой, играйте с ней и уделяйте ей внимание. Кошки нуждаются в физической активности и умственной стимуляции.\n \n";
    public static final String HOW_TO_BUILD_HOME_FOR_CAT = "Как обустроить дом для кота:\n" +
            "* Создайте уютное место для отдыха: Обеспечьте кошке удобное место для сна и отдыха, например, мягкий лежак или подушку в тихом уголке.\n" +
            "* Организуйте когтеточку: Установите когтеточки или специальные когтедралки, чтобы кошка могла точить когти и не портила мебель.\n" +
            "* Игровая зона: Предоставьте кошке игрушки и пространство для игр. Кошки любят лазать, поэтому можно установить полки или кошачьи деревья.\n" +
            "* Безопасность: Убедитесь, что дом безопасен для кошки. Уберите все опасные предметы, закройте окна и балконы, чтобы избежать падений, и спрячьте провода.\n \n";

}
