package pro.sky.animal_shelter.content;

public class TelegramBotContent {


    public static final String WELCOME_MESSAGE = "Добро пожаловать в нашего бота! Введите /help, чтобы узнать, что я могу.";
    public static final String SHELTER_HISTORY = "История нашего приюта\n\n" +
            "Наш приют для животных был основан в 2010 году небольшой группой волонтеров, страстно увлеченных защитой и заботой о бездомных животных. " +
            "Все началось с того, что несколько друзей объединили свои усилия, чтобы помочь бездомным кошкам и собакам, которые нуждались в крыше над головой, питании и медицинской помощи.\n\n" +
            "Путь к созданию приюта\n\n" +
            "Изначально волонтеры собирали животных с улиц и временно размещали их у себя дома, находя им временные семьи. Но количество нуждающихся животных росло, и стало очевидно, что необходима более постоянная структура, где можно было бы обеспечивать уход и помощь на долгосрочной основе.\n\n" +
            "В 2012 году, благодаря пожертвованиям добрых людей и усилиям волонтеров, удалось арендовать первое небольшое помещение для приюта. С тех пор наш приют начал расти и развиваться.\n\n" +
            "Рост и развитие\n\n" +
            "В течение первых нескольких лет приют прошел через множество трудностей. Нам приходилось сталкиваться с недостатком средств, нехваткой волонтеров и ограниченными возможностями для размещения животных. Но благодаря поддержке сообщества и неустанной работе нашей команды, мы постепенно смогли расширить наш приют.\n\n" +
            "К 2015 году мы уже имели отдельные помещения для собак и кошек, а также медицинский кабинет, где наши подопечные могли получать необходимую ветеринарную помощь. Мы начали сотрудничать с местными ветеринарами и клиниками, что позволило нам улучшить качество ухода за животными.\n\n" +
            "Сегодня\n\n" +
            "Сегодня наш приют является домом для более чем 100 животных, которые ждут своего нового любящего хозяина. Мы активно занимаемся не только спасением и размещением животных, но и просветительской деятельностью. Проводим уроки доброты в школах, организуем дни открытых дверей и мероприятия по сбору средств.\n\n" +
            "Наши главные цели остаются неизменными:\n" +
            "- Обеспечение временного приюта для бездомных животных.\n" +
            "- Поиск постоянных любящих домов для наших подопечных.\n" +
            "- Просвещение населения о важности гуманного отношения к животным и необходимости их защиты.\n\n" +
            "Мы верим, что каждый маленький шаг делает мир лучше для наших пушистых друзей. Благодаря поддержке волонтеров, спонсоров и всех неравнодушных людей, мы продолжаем нашу миссию по спасению и защите животных.";
}
