package pro.sky.animal_shelter.content;

public class TelegramBotContent {

    public static final String WELCOME_MESSAGE = "Добро пожаловать в нашего бота! Введите /help, чтобы узнать, что я могу.";

    public static final String HISTORY = "Хаски — сила и скорость, сравниться с которой может только ветер, воплощение духа свободы, воплощение мечты." +
            "Красота ледяных глаз сыграла с ними злую шутку. Глянцевые таблоиды, сверкающие киноленты, ламповые блоги сделали этих собак пленниками минутных желаний человека." +
            "Зачастую принося домой синеглазого щенка люди не представляют и половины трудностей, с которыми им придется столкнуться, чтобы из маленького комочка выросла достойная, здоровая, социализированая собака. " +
            "В нашем приюте содержится сегодня более 60 собак породы хаски. Каждая из них имеет свою историю, каждая пережила предательство человека." +
            "Мы стараемся реагировать на все обращения о помощи, но, к сожалению, наши ресурсы не безграничны." +
            "Мы верим, что у каждой собаки есть свой человек, и главная задача нашего Фонда — помочь им встретиться!" +
            " На данный момент обрели новый дом более 200 собак. В настоящее время на всей территории Большого Урала не существует приюта для гладкошерстных собак серьезных пород," +
            " поэтому помощь получают далеко не все, кто в ней нуждается.";

    public static final String ADDRES = "Свердловская область, Каменский городской округ, село Черемхово, координаты на карте 56.521009, 61.793812.";

    public static final String SCHEMA_SHELTER = "https://keephere.ru/get/_MzDKXreNJ9/o/photo.jpg";

    public static final String OPENING_HOURS = "Что такое счастье?\n" +
            "\n" +
            "Люди веками ищут ответ на этот вопрос.\n" +
            "Для собак мир устроен гораздо проще.\n" +
            "\n" +
            "Счастье - это поводок в ваших руках….\n" +
            "Счастье - это возможность бежать рядом с вами...\n" +
            "Счастье - это ваши эмоции и объятия…\n" +
            "Счастье - это несколько часов вместе.\n" +
            "\n" +
            "Человека нельзя осчастливить, но вот подарить радость бездомной собаке - может каждый из вас.\n" +
            "\n" +
            "Каждые выходные с 10 до 17 мы приглашаем всех в гости!\n" +
            "В одиночку или в компании, с коллегами или с семьей!\n" +
            "Приезжайте!\n" +
            "У нас счастья хватит на всех!\n" +
            "Предварительная запись обязательна!";

    public static final String DONATE = "Помощь собакам фенотипа сибирский хаски, аляскинский маламут, самоед.\n" +
            "\n" +
            "Друзья, мы - маленькая команда единомышленников, и все, что мы делаем, мы делаем, только благодаря Вашей поддержке!\n" +
            "\n" +
            "Истории всех наших подопечных можно прочитать на нашем сайте\n" +
            "\n" +
            "БЛАГОТВОРИТЕЛЬНЫЙ ФОНД \"СЧАСТЬЕ В ДОМ\"\n" +
            "Расчётный счёт: 40701810116540000449\n" +
            "ИНН: 6679129573\n" +
            "КПП: 667901001\n" +
            "ОГРН: 1196658078814\n" +
            "Банк: УРАЛЬСКИЙ БАНК ПАО СБЕРБАНК\n" +
            "БИК: 046577674\n" +
            "Кор. счёт: 30101810500000000674";

    public static final String SAFETY_MEASURES = "Наш приют находится в поле близ села Черемхово, одевайтесь соответственно и по погоде." +
            "В теплое время года не забывайте о акарицидно-реппелентных средствах. Мы со своей стороны обещаем вам тёплый приём, ароматный чай, " +
            "место для отдыха и переодевания и подробную экскурсию с рассказом о наших подопечных.";
}
